perftest/scripts/get-dynamodb-person.yml
config:
    target: "{URL}"
    phases:
      - duration: 300
        arrivalRate: 10
    payload: 
        path: "dynamodbusers.csv"
        fields: 
            - "govid"

scenarios:
    - flow:
        - get:
            url: "/dynamodb/{{ govid }}"
        # Print the data we're sending while debugging the script:
        - log: "Sent a request to /dynamodb with {{ govid }}"